app/Content.php

select `id`, `title`, `pageContent`, `photo` from `contents`
---
    public static function mainPage() {
        return DB::table("contents")->select("id", "title", "pageContent", "photo")->get();

select count(*) as aggregate from `contents`
---
    public static function mainCount() {
        return DB::table("contents")->count();