app/Dogs_photo.php

    public static function delDiskPhoto($id) {
        return DB::table("dogs_photos")->where("id", $id)->value("photo");
---
select `photo` from `dogs_photos` where `id` = '28' limit 1