app/Litter.php

    public static function mainPage() {
        $temp = DB::table('litters')
                ->select('our_dogs.name AS name1', 'p.name AS name2', 'litters.*')
                ->join('our_dogs', 'our_dogs.id_dogs', 'litters.idDog1')
                ->join('our_dogs as p', 'p.id_dogs', 'litters.idDog2')
                ->paginate(4);;
---
select count(*) as aggregate from `litters` inner join `our_dogs` on `our_dogs`.`id_dogs` = `litters`.`idDog1` inner join `our_dogs` as `p` on `p`.`id_dogs` = `litters`.`idDog2`