app/Our_dog.php

select count(*) as aggregate from `our_dogs` left join `dogs_photos` on `dogs_photos`.`id_dogs` = `our_dogs`.`id_dogs` group by `name`
select distinct `dogs_photos`.`photo`, `our_dogs`.* from `our_dogs` left join `dogs_photos` on `dogs_photos`.`id_dogs` = `our_dogs`.`id_dogs` group by `name` order by `date_age` desc limit 8 offset 0
---
    public static function ourDogs() {
        return DB::table('our_dogs')->select('dogs_photos.photo', 'our_dogs.*')
                ->leftJoin('dogs_photos', 'dogs_photos.id_dogs', 'our_dogs.id_dogs')
                ->orderBy('date_age', 'desc')->groupBy('name')->distinct('name')
                ->paginate(8);