app/Http/Controllers/DogController.php

select * from `dogs_photos` where `id_dogs` in ('28')
---
    public function index() {
        $dogs = DB::table('our_dogs')->select('dogs_photos.photo', 'our_dogs.*')
                ->leftJoin('dogs_photos', 'dogs_photos.id_dogs', 'our_dogs.id_dogs')
                ->where('our_dogs.little', '=', '1')->orderBy('name')
                ->groupBy('name')->distinct('name')->get();

       return view("dogs1", ["dogs" => $dogs]);
        /*
        $dogs = Our_dog::select("dogs_photos.*", "our_dogs.*")
    ->join("dogs_photos", "dogs_photos.id_dogs", "our_dogs.id_dogs")
    ->orderBy("our_dogs.name")->get();
    return view("dogs1", ["dogs1" => $dogs]);
         *
         */
        /*
        $dogs = DB::table("our_dogs")->where("little", "=", "1")->orderBy("date_age", "desc")->get();
        $photos = DB::table("dogs_photos")->get();

select * from `dogs_photos` where `id_dogs` is null
---
    public function dogs() {
        $dogs = DB::table('our_dogs')->select('dogs_photos.photo', 'our_dogs.*')
                ->leftJoin('dogs_photos', 'dogs_photos.id_dogs', 'our_dogs.id_dogs')
                ->where('our_dogs.little', '=', '0')->orderBy('date_age', 'desc')
                ->groupBy('name')->distinct('name')->get();
        return view("dogs", ["dogs" => $dogs]);

        /*
        $dogs = DB::table("our_dogs")->where("little", "=", "0")->get();
        $photos = DB::table("dogs_photos")->get();

insert into `our_dogs` (`sex`, `name`, `date_age`, `dbres`, `sale`, `updated_at`, `created_at`) values ('0', '1', '2019-03-01', 'http://www.ccddb.com/local/foo/bar.html', '0', '2019-03-18 20:19:30', '2019-03-18 20:19:30')
---
    public function save(DogRequest $request) {
    if ($request->has("id_dogs")) {
      $dog = Our_dog::findOrFail($request->id_dogs);
      $dog->fill($request->all())->save();
      $s = " исправлена";
    } else {
      $dog = Our_dog::create($request->all());