app/Http/Controllers/NewsController.php

    public function index() {
        $news = DB::table("our_news")->orderBy("id", "desc")->paginate(4);
---
select * from `our_news` order by `id` desc limit 4 offset 0
select count(*) as aggregate from `our_news`

  public function destroy(OurNews $nes) {
    $name = $nes->title;
    OurNews::destroy($nes->id);
---
delete from `our_news` where `id` = '30'