app/Http/Controllers/UserController.php

select `id`, `email`, `name`, `role` from `users` order by `email` asc
---
  public function index() {
    $users = User::select("id", "email", "name", "role")->orderBy("email")->get();